# DimensionLineStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting..::..DimensionLineStyle Property
OrdinateDimensionSetting Class See Also
---
Specifies the dimension line style.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public OrdinateDimensionLineStyle DimensionLineStyle { get; set; }
```

Visual Basic
---
```text
Public Property DimensionLineStyle As OrdinateDimensionLineStyle
	Get
	Set
```

Visual C++
---
```text
public:
property OrdinateDimensionLineStyle DimensionLineStyle {
	OrdinateDimensionLineStyle get ();
	void set (OrdinateDimensionLineStyle value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace